app/views/names/index.html.erb

      <tr>
        <td><%= name.first_name %></td>
---
SELECT "names".* FROM "names"