app/controllers/names_controller.rb

SELECT "names".* FROM "names"
---
  def index
    @names = Name.all

INSERT INTO "names" ("created_at", "first_name", "last_name", "middle_name", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2015-05-05 22:22:58.889401"], ["first_name", "Alexander"], ["last_name", "Crammer"], ["middle_name", "Rhett"], ["updated_at", "2015-05-05 22:22:58.889401"]]
---
  def create
    @name = Name.new(name_params)

    respond_to do |format|
      if @name.save

DELETE FROM "names" WHERE "names"."id" = $1  [["id", 3]]
---
  def destroy
    @name.destroy

SELECT  "names".* FROM "names"  WHERE "names"."id" = $1 LIMIT 1  [["id", 3]]
---
    def set_name
      @name = Name.find(params[:id])